tap "adoptopenjdk/openjdk"
tap "homebrew/cask-drivers"

brew "bat"
brew "bench"
brew "chruby"
brew "colordiff"
brew "direnv"
brew "exa"
brew "fd"
brew "fzf"
brew "goenv"
brew "golang"
brew "haskell-stack"
brew "htop"
brew "inetutils"
brew "jenv"
brew "jq"
brew "luaver"
brew "mas"
brew "neovim"
brew "nvm"
brew "pandoc"
brew "pdfgrep"
brew "pyenv"
brew "r"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn", args: ["ignore-dependencies"]  # the only dependency is node which we will install using nvm
brew "z"
brew "zsh"
brew "zsh-completions"

cask "adoptopenjdk10"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "adoptopenjdk9"
cask "android-file-transfer"
cask "docker"
cask "dropbox"
cask "balenaetcher"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iterm2"
cask "logitech-options"
cask "macpass"
cask "mactex"
cask "rstudio"
cask "skype"
cask "slack"
cask "spotify"
cask "texmaker"
cask "webtorrent"
cask "virtualbox"

# mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Quiver", id: 866773894
mas "WeChat", id: 836500024
